{
    "facts": [
        {
            "fact": "Minke whales are the smallest of the baleen whale species.",
            "img": "https://www.nhm.ac.uk/content/dam/nhmwww/discover/baby-whale-thames/baby-minke-thames-full-width.jpg"
        },
        {
            "fact": "Minke whales showcase a remarkable array of vocalizations, including distinct 'boings' that sound like a metallic spring being stretched, adding a unique auditory dimension to their underwater communication.",
            "img": "https://ocr.org/wp-content/uploads/igor-francetic-630981-unsplash.jpg"
        },
        {
            "fact": "Recognized for their swift and unpredictable feeding behaviors, minke whales are known to execute sudden 180-degree turns while pursuing prey, displaying agility that surprises even seasoned marine observers.",
            "img": "https://www.ecomagazine.com/images/Newsletter/0_2023/Week-03-13-23/1-MinkeWhales.jpg"
        },
        {
            "fact": "Minke whales boast a distinctive 'rostrum arch,' an upward curve at the front of their mouths. This feature allows them to create unique water patterns while swimming, contributing to their playful and enigmatic demeanor.",
            "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Dwarf_minke_whale_%2830694501214%29.jpg/640px-Dwarf_minke_whale_%2830694501214%29.jpg"
        },
        {
            "fact": "Unlike many baleen whales, minke whales have a penchant for breaching horizontally rather than vertically, creating an astonishing display as they glide along the ocean surface with their bodies parallel to the water.",
            "img": "https://ichef.bbci.co.uk/news/976/cpsprodpb/BA82/production/_118864774_minkebreach3.jpg"
        },
        {
            "fact": "Minke whales exhibit a fascinating variation in coloration, with some individuals featuring unique patterns and markings. This diversity contributes to ongoing research efforts focused on understanding the intricacies of their populations.",
            "img": "https://katv.com/resources/media/19312a2b-b9a7-49da-b899-1243b067d966-AP18080168097070.jpg"
        },
        {
            "fact": "With a smaller size and rapid swimming abilities, minke whales are elusive and challenging to study, adding an element of mystery to their behaviors and ecological roles within marine ecosystems.",
            "img": "https://factanimal.com/wp-content/uploads/2023/03/minke-whale-facts.jpg"
        },
        {
            "fact": "Minke whales, despite their relative abundance, face challenges such as climate-related shifts in prey availability and potential impacts from human activities. Ongoing conservation efforts are vital for ensuring their resilience and continued existence.",
            "img": "https://www.sanjuanjournal.com/wp-content/uploads/2022/10/30705586_web1_minke-ISJ-221019-minke_1.jpg"
        }
    ]
}