{
    "facts": [
        {
            "fact": "Humpback whales are known for their acrobatic displays, including breaching, tail slapping, and pectoral fin waving, making them a favorite among whale watchers.",
            "img": "https://adventures.is/media/232839/whale-on-a-sunset-above-the-water.jpg?anchor=center&mode=crop&width=970&height=645&rnd=133293077810000000&quality=80&format=jpg"
        },
        {
            "fact": "Humpback whales are renowned for their haunting and complex songs, which can travel great distances underwater. Each population has its own unique song that evolves over time.",
            "img": "https://dosits.org/wp-content/uploads/2017/05/mmsoundproduction_cetaceans-discovery-of-sound-in-the-sea-uri-figure2_600.jpg"
        },
        {
            "fact": "Humpback whales engage in cooperative feeding behaviors, such as bubble-netting, where a group releases bubbles to corral and concentrate prey, making it easier to capture.",
            "img": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2019/10/101519_sb_whale-hunting_feat.jpg?fit=1028%2C579&ssl=1"
        },
        {
            "fact": "Humpback whales undertake extensive migrations, traveling thousands of miles between their feeding and breeding grounds. Their journey takes them from cold polar waters to warmer tropical or subtropical regions.",
            "img": "https://www.diveninjaexpeditions.com/wp-content/uploads/2019/10/HW_Infographic_Migration.jpg"
        },
        {
            "fact": "Humpback whales are known for their altruistic behavior, occasionally intervening to protect other marine animals from predators, such as orcas attacking seals or sea lions.",
            "img": "https://hakaimagazine.com/wp-content/uploads/killer-whale-seal-hardwared-compassion.jpg"
        },
        {
            "fact": "Humpback whales have distinctive long pectoral fins, which can reach up to one-third of their body length. These fins are used for steering, stabilizing, and performing their impressive acrobatics.",
            "img": "https://cornforthimages.com/wp-content/uploads/2012/11/Humpback-Whale-Pectoral-Fin-10.jpg"
        },
        {
            "fact": "Humpback whales are known to breach with incredible force, launching their massive bodies out of the water and creating a spectacular splash. The reasons for breaching are not fully understood but may include communication or parasite removal.",
            "img": "https://ftw.usatoday.com/wp-content/uploads/sites/90/2021/05/calf_wide-2.jpg?w=1000&h=600&crop=1"
        },
        {
            "fact": "Despite the end of commercial whaling, humpback whales still face threats such as entanglement in fishing gear, ship strikes, and ocean noise. Conservation efforts are crucial for the continued well-being of these majestic creatures.",
            "img": "https://sanctuaries.noaa.gov/news/jun17/entangled-whale-1000.jpg"
        }
        ]
}